In [1]:
# Dependencies
import pandas as pd

In [2]:
# Load Files
school_data = '../Resources/schools_complete.csv'
student_data = '../Resources/students_complete.csv'

In [3]:
school_df = pd.read_csv(school_data)
student_df = pd.read_csv(student_data)
# student_df.head()
# student_df.columns

In [4]:
# Merging data into single data set
complete_df = pd.merge(student_df, school_df, how="left", on=["school_name", "school_name"])
# complete_df.head()
# complete_df.columns
# complete_df.head()
complete_df.columns

Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score', 'School ID', 'type', 'size', 'budget'],
      dtype='object')

In [5]:
# Calculate total numbers of schools
school_count = len(complete_df["school_name"].unique())
# school_count

In [6]:
# Calculate total number of students
student_count = len(complete_df["student_name"].unique())
# student_count

In [7]:
# complete_df.dtypes

In [8]:
# Calculate Total Budget -  I'm using groupby method
# make copy of merged data frame
# create data framed grouped by school name column with copy if the merged data frame
complete_copy_df = complete_df.copy()
complete_copy_df.columns

Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score', 'School ID', 'type', 'size', 'budget'],
      dtype='object')

In [9]:
# group by data frame 
grouped_df = complete_copy_df.groupby(["school_name"])

print(grouped_df)

# grouped_df.count()

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001D743E92AC8>

In [10]:
# Getting value counts for budgets for each school
grouped_df["budget"].value_counts()

school_name            budget
Bailey High School     3124928    4976
Cabrera High School    1081356    1858
Figueroa High School   1884411    2949
Ford High School       1763916    2739
Griffin High School    917500     1468
Hernandez High School  3022020    4635
Holden High School     248087      427
Huang High School      1910635    2917
Johnson High School    3094650    4761
Pena High School       585858      962
Rodriguez High School  2547363    3999
Shelton High School    1056600    1761
Thomas High School     1043130    1635
Wilson High School     1319574    2283
Wright High School     1049400    1800
Name: budget, dtype: int64

In [11]:
# create data frame for the average budget for each school, then take sum of the dataframe to get to total budget
school_budgets_df = grouped_df["budget"].mean()
# school_budgets_df.sum()
total_budget = school_budgets_df.sum()
total_budget

24649428

In [12]:
# Calculate Average Math Score
# use grouped data frame,  check value counts for math score
# grouped_df["math_score"].value_counts()
school_average_mathscore_df = grouped_df["math_score"].mean()
school_average_mathscore_df.mean()

80.43252976460249

In [13]:
# calculate average math score - not by school though - by all the stundents
# creating grouped dataframe by students
# complete_copy_df
student_grouped_df = complete_copy_df.groupby(["student_name"])
print(student_grouped_df)
# student_grouped_df.count().head()

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001D743E83108>

In [14]:
# calculate average math score continued
# use stundent groupby data frame to check math score
# student_grouped_df["math_score"].value_counts()
# student_grouped_df["math_score"].mean().mean()
average_math_score = student_grouped_df["math_score"].mean().mean()
average_math_score

78.99834099820231

In [15]:
# calculate average reading score
# use student grouped data frame, filter reading scores for each student, take average, take average
# student_grouped_df["reading_score"].value_counts()
average_reading_score = student_grouped_df["reading_score"].mean().mean()
average_reading_score

81.87905805751977

In [16]:
# Calculate the percentage of students with a passing math score (70 or greater)
# set variable and get value for total students
total_students = len(complete_copy_df["student_name"])
# total_students

In [17]:
# find number of students who have a math score of 70 or greater using LOC
passing_math_students = complete_copy_df.loc[complete_copy_df["math_score"] >= 70]


print(passing_math_students)

       Student ID     student_name gender grade         school_name  \
0               0     Paul Bradley      M   9th   Huang High School
4               4       Bonnie Ray      F   9th   Huang High School
5               5    Bryan Miranda      M   9th   Huang High School
6               6    Sheena Carter      F  11th   Huang High School
8               8     Michael Roth      M  10th   Huang High School
...           ...              ...    ...   ...                 ...
39165       39165     Donna Howard      F  12th  Thomas High School
39166       39166        Dawn Bell      F  10th  Thomas High School
39167       39167   Rebecca Tanner      F   9th  Thomas High School
39168       39168     Desiree Kidd      F  10th  Thomas High School
39169       39169  Carolyn Jackson      F  11th  Thomas High School

       reading_score  math_score  School ID      type  size   budget
0                 66          79          0  District  2917  1910635
4                 97          84          0  District  2917  1910635
5                 94          94          0  District  2917  1910635
6                 82          80          0  District  2917  1910635
8                 95          87          0  District  2917  1910635
...              ...         ...        ...       ...   ...      ...
39165             99          90         14   Charter  1635  1043130
39166             95          70         14   Charter  1635  1043130
39167             73          84         14   Charter  1635  1043130
39168             99          90         14   Charter  1635  1043130
39169             95          75         14   Charter  1635  1043130

[29370 rows x 11 columns]

In [18]:
# set variable and value for total students who are passing math
total_passing_math_students = len(passing_math_students)
total_passing_math_students

29370

In [19]:
# find number of student who have a math score of 70 or greater
passing_reading_students = complete_copy_df.loc[complete_copy_df["reading_score"] >= 70]

print(passing_reading_students)

       Student ID     student_name gender grade         school_name  \
1               1     Victor Smith      M  12th   Huang High School
2               2  Kevin Rodriguez      M  12th   Huang High School
4               4       Bonnie Ray      F   9th   Huang High School
5               5    Bryan Miranda      M   9th   Huang High School
6               6    Sheena Carter      F  11th   Huang High School
...           ...              ...    ...   ...                 ...
39165       39165     Donna Howard      F  12th  Thomas High School
39166       39166        Dawn Bell      F  10th  Thomas High School
39167       39167   Rebecca Tanner      F   9th  Thomas High School
39168       39168     Desiree Kidd      F  10th  Thomas High School
39169       39169  Carolyn Jackson      F  11th  Thomas High School

       reading_score  math_score  School ID      type  size   budget
1                 94          61          0  District  2917  1910635
2                 90          60          0  District  2917  1910635
4                 97          84          0  District  2917  1910635
5                 94          94          0  District  2917  1910635
6                 82          80          0  District  2917  1910635
...              ...         ...        ...       ...   ...      ...
39165             99          90         14   Charter  1635  1043130
39166             95          70         14   Charter  1635  1043130
39167             73          84         14   Charter  1635  1043130
39168             99          90         14   Charter  1635  1043130
39169             95          75         14   Charter  1635  1043130

[33610 rows x 11 columns]

In [20]:
# set variable and value for total students who are passing reading
total_passing_reading_students = len(passing_reading_students)
total_passing_reading_students

33610

In [21]:
# calculating percentage of students passing math and percentage of students passing reading passing divide by total student
# need to convert to correct data type

In [22]:
# calculate percent of students passing math
percent_passing_math = (total_passing_math_students / total_students) * 100
percent_passing_math

74.9808526933878

In [23]:
# calculate percent of students passing reading
percent_passing_reading =  (total_passing_reading_students / total_students) * 100
percent_passing_reading

85.80546336482001

In [24]:
# calculate percent of students who passed math and reading
# using loc for students who have 70 or greater in math and 70 or greater in reading (dont forget to print)
overall_passing = complete_copy_df.loc[(complete_copy_df["math_score"] >= 70) & (complete_copy_df["reading_score"] >= 70)]
print(overall_passing)

       Student ID     student_name gender grade         school_name  \
4               4       Bonnie Ray      F   9th   Huang High School
5               5    Bryan Miranda      M   9th   Huang High School
6               6    Sheena Carter      F  11th   Huang High School
8               8     Michael Roth      M  10th   Huang High School
9               9   Matthew Greene      M  10th   Huang High School
...           ...              ...    ...   ...                 ...
39165       39165     Donna Howard      F  12th  Thomas High School
39166       39166        Dawn Bell      F  10th  Thomas High School
39167       39167   Rebecca Tanner      F   9th  Thomas High School
39168       39168     Desiree Kidd      F  10th  Thomas High School
39169       39169  Carolyn Jackson      F  11th  Thomas High School

       reading_score  math_score  School ID      type  size   budget
4                 97          84          0  District  2917  1910635
5                 94          94          0  District  2917  1910635
6                 82          80          0  District  2917  1910635
8                 95          87          0  District  2917  1910635
9                 96          84          0  District  2917  1910635
...              ...         ...        ...       ...   ...      ...
39165             99          90         14   Charter  1635  1043130
39166             95          70         14   Charter  1635  1043130
39167             73          84         14   Charter  1635  1043130
39168             99          90         14   Charter  1635  1043130
39169             95          75         14   Charter  1635  1043130

[25528 rows x 11 columns]

In [25]:
# set variable for total students overall passing, use length function to get value
total_overall_passing = len(overall_passing)
# total_overall_passing

In [26]:
# find percent of students overall passing
percent_overall_passing = (total_overall_passing / total_students) * 100
percent_overall_passing

65.17232575950983

In [27]:
# creating Data Frame with the results
results_df = pd.DataFrame({"Total Schools": [school_count],
                           "Total Students": total_students,
                           "Total Budget": total_budget,
                           "Average Math Score": average_math_score,
                           "Average Reading Score": average_reading_score,
                           "% Passing Math": percent_passing_math,
                           "% Passing Reading": percent_passing_reading,
                           "% Overall Passing": percent_overall_passing,})

In [28]:
results_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.998341,81.879058,74.980853,85.805463,65.172326

In [29]:
# Formatting Results Data Frame, using Mapping
# for total students

# for total budget
results_df["Total Budget"] = results_df["Total Budget"].map("${:,.2f}".format)
# results_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,"$24,649,428.00",78.998341,81.879058,74.980853,85.805463,65.172326

In [30]:
# Formatt for total students
results_df["Total Students"] = results_df["Total Students"].map("{:,}".format)

In [31]:
results_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",78.998341,81.879058,74.980853,85.805463,65.172326

In [32]:
# School Summary
# want to use the groupby school name data frame that I already created
# use column manipulation to take mean of budget for each school to get the budget for each school
# basically a lot of column manipulation on groupby data frames

In [34]:
# using previously made grouped data frame, which I grouped by school names, Checking counts and value counts, so on
print(grouped_df)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001D743E92AC8>

In [37]:
# what I see from this is that the count of Student ID series with give me the total students per school
# so just total students (=) will be grouped_df["Student ID"].count then change column title in new data frame
# total school budget I already have, the variable is saved as school_budget_df
# budget per student will be new column that calculates school budget / total students
# school type (=) will be grouped_df["type"].value_counts()
grouped_df.count()

,Student ID,student_name,gender,grade,reading_score,math_score,School ID,type,size,budget
school_name,,,,,,,,,,
Bailey High School,4976,4976,4976,4976,4976,4976,4976,4976,4976,4976
Cabrera High School,1858,1858,1858,1858,1858,1858,1858,1858,1858,1858
Figueroa High School,2949,2949,2949,2949,2949,2949,2949,2949,2949,2949
Ford High School,2739,2739,2739,2739,2739,2739,2739,2739,2739,2739
Griffin High School,1468,1468,1468,1468,1468,1468,1468,1468,1468,1468
Hernandez High School,4635,4635,4635,4635,4635,4635,4635,4635,4635,4635
Holden High School,427,427,427,427,427,427,427,427,427,427
Huang High School,2917,2917,2917,2917,2917,2917,2917,2917,2917,2917
Johnson High School,4761,4761,4761,4761,4761,4761,4761,4761,4761,4761
Pena High School,962,962,962,962,962,962,962,962,962,962
Rodriguez High School,3999,3999,3999,3999,3999,3999,3999,3999,3999,3999
Shelton High School,1761,1761,1761,1761,1761,1761,1761,1761,1761,1761
Thomas High School,1635,1635,1635,1635,1635,1635,1635,1635,1635,1635
Wilson High School,2283,2283,2283,2283,2283,2283,2283,2283,2283,2283
Wright High School,1800,1800,1800,1800,1800,1800,1800,1800,1800,1800

In [39]:
grouped_df["type"].value_counts()

school_name            type
Bailey High School     District    4976
Cabrera High School    Charter     1858
Figueroa High School   District    2949
Ford High School       District    2739
Griffin High School    Charter     1468
Hernandez High School  District    4635
Holden High School     Charter      427
Huang High School      District    2917
Johnson High School    District    4761
Pena High School       Charter      962
Rodriguez High School  District    3999
Shelton High School    Charter     1761
Thomas High School     Charter     1635
Wilson High School     Charter     2283
Wright High School     Charter     1800
Name: type, dtype: int64

In [43]:
# average math score by school
school_summary_math_score = grouped_df["math_score"].mean()
# school_summary_math_score

school_name
Bailey High School       77.048432
Cabrera High School      83.061895
Figueroa High School     76.711767
Ford High School         77.102592
Griffin High School      83.351499
Hernandez High School    77.289752
Holden High School       83.803279
Huang High School        76.629414
Johnson High School      77.072464
Pena High School         83.839917
Rodriguez High School    76.842711
Shelton High School      83.359455
Thomas High School       83.418349
Wilson High School       83.274201
Wright High School       83.682222
Name: math_score, dtype: float64

In [44]:
# average reading score by school
school_summary_reading_score = grouped_df["reading_score"].mean()
school_summary_reading_score

school_name
Bailey High School       81.033963
Cabrera High School      83.975780
Figueroa High School     81.158020
Ford High School         80.746258
Griffin High School      83.816757
Hernandez High School    80.934412
Holden High School       83.814988
Huang High School        81.182722
Johnson High School      80.966394
Pena High School         84.044699
Rodriguez High School    80.744686
Shelton High School      83.725724
Thomas High School       83.848930
Wilson High School       83.989488
Wright High School       83.955000
Name: reading_score, dtype: float64

In [48]:
# finding number of students passing math for each school
# finding number of students passing reading for each school
# finding number of students passing both reading and math for each school
# >= 70
math_scores_by_school = grouped_df["math_score"].value_counts()
# math_scores_by_school

school_name         math_score
Bailey High School  91            130
                    61            129
                    68            124
                    81            124
                    63            123
                                 ...
Wright High School  93             49
                    74             48
                    68             47
                    72             45
                    71             43
Name: math_score, Length: 571, dtype: int64

In [57]:
# OVER THINKING
# create the varibales and the values for the columns first 
# create another copy of the complete df and add these columns to that copy
# then make a groupby data frame for the summary with the columns you want
# so still use .loc in the 2nd copy of the complete data frame